Tekla Open API Reference for Tekla Structures 2025
LibraryProfileItem.ProfileName Property
 The profile item name.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string ProfileName { get; set; }
Public Property ProfileName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
LibraryProfileItem Class
Tekla.Structures.Catalogs Namespace